**Dataframe**

**Features**

"DataFrame" is a Data structure used in python.

It is just like a table, containing multiple rows and columns

Every row of a DataFrame holds and index automatically and the index starts from 0.

Many Data Type like List, Dictionary, Series (Data Structure) and Numpy Array can be converted into a DataFrame using Pandas.

DataFrames are indexable both by column and row. Also one can subset a DataFrame based on conditions.

**Lets start working with DataFrame:-**

**Creation Of DataFrame:-**

In [7]:
import pandas as pd #importing library
data = [5,7,2] #list
df = pd.DataFrame(data) #creating dataframe

In [8]:
df #no columns are assigned

   0
0  5
1  7
2  2

**By default every element has an index 0,1,2 and so on....**

In [11]:
data = [['Netflix',15], ['Amazon', 25], ['Hotstar',10]] #n-dimensional array
df = pd.DataFrame(data,columns=['OTT Platforms','Webseries']) #converting to dataframe

In [12]:
df #with column name

  OTT Platforms  Webseries
0       Netflix         15
1        Amazon         25
2       Hotstar         10

In [13]:
import numpy as np
ar = np.array([[1,2,3],[4,5,6],[6,7,8]]) #numpy multidimensional array
df=pd.DataFrame(ar) #converting an array to a dataframe

In [14]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  6  7  8

In [15]:
dictionary_1 = {'Netflix':[1,2,3], 'Amazon':[2,3,4], 'Hotstar':[3,4,5] } #creating dictionary
df = pd.DataFrame(dictionary_1) #converting the dictionary to dataframe

In [16]:
df

   Netflix  Amazon  Hotstar
0        1       2        3
1        2       3        4
2        3       4        5

**Setting index Manually**

In [19]:
df = pd.DataFrame(dictionary_1, index=['1st','2nd','3rd']) #with manual index

In [20]:
df

     Netflix  Amazon  Hotstar
1st        1       2        3
2nd        2       3        4
3rd        3       4        5

**Setting index and column names simultaneously:**

In [23]:
df = pd.DataFrame(ar, index=['Thriller','Comedy','Sci-fi'], columns=['Netflix','Amazon','Hotstar']) #setting index column manually

In [24]:
df

          Netflix  Amazon  Hotstar
Thriller        1       2        3
Comedy          4       5        6
Sci-fi          6       7        8

In [25]:
df2 = df[['Netflix','Amazon']].copy() #creating new dataframe from an old one

In [26]:
df2

          Netflix  Amazon
Thriller        1       2
Comedy          4       5
Sci-fi          6       7

**Indexing Columns and Rows from DataFrame**

In [27]:
df['Hotstar'] #indexing by column/taking only a column from the dataframe

Thriller    3
Comedy      6
Sci-fi      8
Name: Hotstar, dtype: int32

In [28]:
df[['Netflix','Hotstar']] #taking multiple columns from the dataframe

          Netflix  Hotstar
Thriller        1        3
Comedy          4        6
Sci-fi          6        8

In [29]:
c = pd.DataFrame([4,5,6], columns=['Voot']) #creating a new dataframe with a column I want to add
df['Voot'] = c['Voot'] #adding the new column to the existing dataframe

In [30]:
df

          Netflix  Amazon  Hotstar  Voot
Thriller        1       2        3   NaN
Comedy          4       5        6   NaN
Sci-fi          6       7        8   NaN

In [33]:
c = pd.DataFrame([4,5,6], index=['Thriller','Comedy','Sci-fi'], columns=['Voot'])

In [34]:
c

          Voot
Thriller     4
Comedy       5
Sci-fi       6

In [35]:
df['Voot'] = c['Voot']

In [36]:
df

          Netflix  Amazon  Hotstar  Voot
Thriller        1       2        3     4
Comedy          4       5        6     5
Sci-fi          6       7        8     6

**Thank you..**